// Заполняет данные и выполняет ряд действии с формой
&НаКлиенте
Процедура ПривестиПродажиКУчету(Команда)
	
	Объект.ПриводитсяКУчетуПродаж = Истина;
	Элементы.Товары.ТолькоПросмотр = Истина;
	
	ЗаполнитьИзНеучтенныхПродаж();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзНеучтенныхПродаж()
	
	ОстаткиВНеучтенныхПродажах = РегистрыНакопления.НеучтенныеПродажи.Остатки(,, "Товар", "Количество");
	Объект.Товары.Очистить();
	
	Для Каждого Остаток Из ОстаткиВНеучтенныхПродажах Цикл
		Строка = Объект.Товары.Добавить();
		Строка.Товары = Остаток.Товар;
		Строка.Количество = Остаток.Количество;
	КонецЦикла;	
	
КонецПроцедуры
