// Заполняет данные и выполняет ряд действии с формой
&НаКлиенте
Процедура ПривестиПродажиКУчету(Команда)
	
	Объект.ПриводитсяКУчетуПродаж = Истина;
	ЗаполнитьИзНеучтенныхПродаж();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзНеучтенныхПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Товары КАК Товары,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|	ЗаказКлиентаТовары.ВидЕдиницыИзмерения КАК ВидЕдиницыИзмерения
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	Ссылка.ЗаказОприходован = Ложь И
	|	НАЧАЛОПЕРИОДА(Ссылка.Дата, День) = НАЧАЛОПЕРИОДА(&Дата, День)";
	
	Объект.Товары.Очистить();
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = Объект.Товары.Добавить();
			Строка.Товары = Выборка.Товары;
			Строка.Количество = Выборка.Количество;
			Строка.ВидЕдиницыИзмерения = Выборка.ВидЕдиницыИзмерения;
			Строка.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[Выборка.ВидЕдиницыИзмерения];
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.СтандартныеЕдиницыИзмерения = ПараметрыСеанса.СтандартныеЕдиницыИзмерения;		
КонецПроцедуры


&НаКлиенте
Процедура ТоварыТоварыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.ВидЕдиницыИзмерения = ПолучитьВидЕдиницыИзмерения(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[ТекущаяСтрока.ВидЕдиницыИзмерения];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕдиницыИзмерения(Номенклатура)
	Возврат Номенклатура.ПолучитьОбъект().ВидЕдиницыИзмерения;
КонецФункции

