
&НаКлиенте
Процедура ТоварыТоварыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьЦенуПродажи1(ТекущаяСтрока.Товары);
	ОбновитьЦену();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбновитьЦену();
КонецПроцедуры

//внизу неработающая, самая первая работающая
&НаСервере
Функция ПолучитьЦенуПродажи1(Товар)
	Возврат Справочники.Товары.НайтиПоНаименованию("Наименование", Товар,,).Цена;
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбновитьЦену();
КонецПроцедуры

&НаКлиенте
Функция ОбновитьЦену()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
КонецФункции

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары;
КонецПроцедуры
