// Заполняет данные и выполняет ряд действии с формой
&НаКлиенте
Процедура ПривестиПродажиКУчету(Команда)
	
	Объект.ПриводитсяКУчетуПродаж = Истина;
	Элементы.Товары.ТолькоПросмотр = Истина;
	
	ЗаполнитьИзНеучтенныхПродаж();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзНеучтенныхПродаж()
	
	ОстаткиВНеучтенныхПродажах = РегистрыНакопления.НеучтенныеПродажи.Остатки(,, "Товар", "Количество");
	Объект.Товары.Очистить();
	
	Для Каждого Остаток Из ОстаткиВНеучтенныхПродажах Цикл
		Строка = Объект.Товары.Добавить();
		Строка.Товары = Остаток.Товар;
		Строка.Количество = Остаток.Количество;
		Строка.ВидЕдиницыИзмерения = Остаток.Товар.ВидЕдиницыИзмерения;
		Строка.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[Строка.ВидЕдиницыИзмерения];
		Строка.Множитель = МножителиЕдиницИзмерения[Строка.ЕдиницаИзмерения];
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.СтандартныеЕдиницыИзмерения = ПараметрыСеанса.СтандартныеЕдиницыИзмерения;
	ЭтотОбъект.МножителиЕдиницИзмерения = ПараметрыСеанса.МножителиЕдиницИзмерения;
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТекСтрока.Множитель = МножителиЕдиницИзмерения[ТекСтрока.ЕдиницаИзмерения];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Множитель = МножителиЕдиницИзмерения[ТекущаяСтрока.ЕдиницаИзмерения];
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.ВидЕдиницыИзмерения = ПолучитьВидЕдиницыИзмерения(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[ТекущаяСтрока.ВидЕдиницыИзмерения];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕдиницыИзмерения(Номенклатура)
	Возврат Номенклатура.ПолучитьОбъект().ВидЕдиницыИзмерения;
КонецФункции

