&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерений) Тогда
		Запись.Количество = Запись.Количество * МножителиЕдиницИзмерении[ЕдиницаИзмерений];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентПриИзменении(Элемент)
	ВидЕдиницыИзмерения = ПолучитьВидЕИ(Запись.Ингредиент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕИ(Номенклатура)
	Возврат Номенклатура.ВидЕдиницыИзмерения;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.МножителиЕдиницИзмерении = ПараметрыСеанса.МножителиЕдиницИзмерения;
	
	Если Запись.Ингредиент <> Неопределено Тогда
		ВидЕдиницыИзмерения = ПолучитьВидЕИ(Запись.Ингредиент);
	КонецЕсли;
	
КонецПроцедуры
