&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерений) Тогда
		Запись.Количество = МодульКонвертированияЕдиницИзмерения.ВСтандартнуюЕИКонвертировать(ЕдиницаИзмерений, Запись.Количество);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентПриИзменении(Элемент)
	ВидЕдиницыИзмерения = ПолучитьВидЕИ(Запись.Ингредиент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕИ(Номенклатура)
	Возврат Номенклатура.ВидЕдиницыИзмерения;
КонецФункции
