Процедура ПечатьЗаказПоставщику(ТабДок, Ссылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщика.Номер КАК Номер,
		|	ЗаказПоставщика.Дата КАК Дата,
		|	ЗаказПоставщика.Контрагент КАК Контрагент,
		|	ЗаказПоставщика.Договор КАК Договор,
		|	ЗаказПоставщика.Ссылка КАК Ссылка,
		|   ЗаказПоставщика.Сумма КАК СуммаИтого,
		|	ЗаказПоставщика.Товары.(
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма
		|	) КАК Товар
		|ИЗ
		|	Документ.ЗаказПоставщика КАК ЗаказПоставщика
		|ГДЕ
		|	ЗаказПоставщика.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// Вывод макета
	Макет = Документы.ЗаказПоставщика.ПолучитьМакет("Макет");
	ЗаголовокОбл = Макет.ПолучитьОбласть("Заголовок");
	ШапкаОбл = Макет.ПолучитьОбласть("Шапка");
	ТоварыШапкаОбл = Макет.ПолучитьОбласть("ТоварыШапка");
	ТоварыОбл = Макет.ПолучитьОбласть("Товары");
	ПодвалИтогОбл = Макет.ПолучитьОбласть("ПодвалИтог");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			
			ТабДок.Вывести(ЗаголовокОбл);
			
			ШапкаОбл.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ШапкаОбл, Выборка.Уровень());
			
			ТабДок.Вывести(ТоварыШапкаОбл);
			
			ВыборкаТовары = Выборка.Товар.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				ТоварыОбл.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ТоварыОбл, ВыборкаТовары.Уровень());
			КонецЦикла;
			
			ПодвалИтогОбл.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ПодвалИтогОбл);
			
			ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
		
КонецПроцедуры