// Проверка уникальности в табличном документе
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапросНаУникальность = Новый Запрос;
	ЗапросНаУникальность.Текст = "
	|ВЫБРАТЬ
	|	Товары.Товар КАК Товар
	|ИЗ
	|	Документ.РеализацияАссортимента.ИзготавливаемыеТовары КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Товар
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > 1";
	
	РезультатЗапроса = ЗапросНаУникальность.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Невозможно записать документ: Значения товаров в табличной части должны быть уникальными!");
	КонецЕсли;
	
КонецПроцедуры

// Заполнение данных в табличный документ из регистра накопления НеучтенныеПродажи
&НаКлиенте
Процедура ЗаполнитьИзНеучтенныхПродаж(Команда)
	
	ЗаполнитьНеучтенныеПродажи();
	ИзготавливаемыеТоварыПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеучтенныеПродажи()
	
	ОстаткиВНеучтенныхПродажах = РегистрыНакопления.НеучтенныеПродажи.Остатки(,, "Товар", "Количество");
	Объект.ИзготавливаемыеТовары.Очистить();
	
	Для Каждого Остаток Из ОстаткиВНеучтенныхПродажах Цикл
		Строка = Объект.ИзготавливаемыеТовары.Добавить();
		Строка.Товар = Остаток.Товар;
		Строка.ИзготавливаемоеКоличество = Остаток.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзготавливаемыеТоварыПриИзменении(Элемент)
	
	СтруктураОстатков = Новый Соответствие();
	Объект.Остатки.Очистить();
		
	Для Каждого СтрокаТовары Из Объект.ИзготавливаемыеТовары Цикл
		Товар = СтрокаТовары.Товар;
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Товар", Товар);
		
		Для Каждого СтрокаРецепта Из ТаблицаРецептур.НайтиСтроки(ПараметрыОтбора) Цикл
			Если СтруктураОстатков.Получить(СтрокаРецепта.Ингредиент) = Неопределено Тогда
				СтруктураОстатков.Вставить(СтрокаРецепта.Ингредиент, СтрокаРецепта.Количество * СтрокаТовары.ИзготавливаемоеКоличество);
			Иначе
				СтруктураОстатков[СтрокаРецепта.Ингредиент] = СтруктураОстатков[СтрокаРецепта.Ингредиент] + (СтрокаРецепта.Количество * СтрокаТовары.ИзготавливаемоеКоличество);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаОстатки Из СтруктураОстатков Цикл
		Стр = Объект.Остатки.Добавить();
		Стр.Ингредиент = СтрокаОстатки.Ключ;
		Стр.Количество = СтрокаОстатки.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РецептураНаборЗаписей = РегистрыСведений.СведенияОРецептуре.Выбрать();
	
	Пока РецептураНаборЗаписей.Следующий() Цикл
		СтрокаТабЧасти = ТаблицаРецептур.Добавить();
		СтрокаТабЧасти.Товар = РецептураНаборЗаписей.Товар;
		СтрокаТабЧасти.Ингредиент = РецептураНаборЗаписей.Ингредиент;
		СтрокаТабЧасти.Количество = РецептураНаборЗаписей.Количество;
	КонецЦикла;
	
КонецПроцедуры
