
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ВыполнитьЗаполнениеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ВыполнитьЗаполнениеОстатков();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеОстатков() Экспорт
	
	СтруктураОстатков = Новый Соответствие();
	СтруктураЕдиницИзмерения = Новый Соответствие();
	Объект.Остатки.Очистить();
		
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Товар", Объект.Товар);
		
	Для Каждого СтрокаРецепта Из ТаблицаРецептур.НайтиСтроки(ПараметрыОтбора) Цикл
		Если СтруктураОстатков.Получить(СтрокаРецепта.Ингредиент) = Неопределено Тогда
			СтруктураОстатков.Вставить(СтрокаРецепта.Ингредиент, СтрокаРецепта.Количество * Объект.Количество);
		Иначе
			СтруктураОстатков[СтрокаРецепта.Ингредиент] = СтруктураОстатков[СтрокаРецепта.Ингредиент] + (СтрокаРецепта.Количество * Объект.Количество);
		КонецЕсли;
		
		СтруктураЕдиницИзмерения.Вставить(СтрокаРецепта.Ингредиент, СтрокаРецепта.ВидЕдиницыИзмерения);
	КонецЦикла;
	
	
	Для Каждого СтрокаОстатки Из СтруктураОстатков Цикл
		Стр = Объект.Остатки.Добавить();
		Стр.Ингредиент = СтрокаОстатки.Ключ;
		Стр.Количество = СтрокаОстатки.Значение;
		Стр.ВидЕдиницыИзмерения = СтруктураЕдиницИзмерения.Получить(СтрокаОстатки.Ключ);
		Стр.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[Стр.ВидЕдиницыИзмерения];
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Регистр.Товар КАК Товар,
	|	Регистр.Ингредиент КАК Ингредиент,
	|	Регистр.Количество КАК Количество,
	|	Номенклатура.ВидЕдиницыИзмерения КАК ВидЕдиницыИзмерения
	|ИЗ
	|	РегистрСведений.СведенияОРецептуре КАК Регистр
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ПО
	|	Регистр.Ингредиент = Номенклатура.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		РецептураНаборЗаписей = РезультатЗапроса.Выбрать();	
		
		Пока РецептураНаборЗаписей.Следующий() Цикл
			СтрокаТабЧасти = ТаблицаРецептур.Добавить();
			СтрокаТабЧасти.Товар = РецептураНаборЗаписей.Товар;
			СтрокаТабЧасти.Ингредиент = РецептураНаборЗаписей.Ингредиент;
			СтрокаТабЧасти.Количество = РецептураНаборЗаписей.Количество;
			СтрокаТабЧасти.ВидЕдиницыИзмерения = РецептураНаборЗаписей.ВидЕдиницыИзмерения;
		КонецЦикла;
	КонецЕсли;
	
	СтандартныеЕдиницыИзмерения = ПараметрыСеанса.СтандартныеЕдиницыИзмерения;
	
КонецПроцедуры