
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиНоменклатур.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатур.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товары;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Движения.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрОстатковОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	РегистрОстатковОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатур.Остатки(&Дата, Номенклатура В (&Товары)) КАК РегистрОстатковОстатки
		|ГДЕ
		|	РегистрОстатковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Товары"));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Пока Выборка.Следующий() Цикл
			Сообщить("Произошла ошибка: Количество товара " + Выборка.НоменклатураНаименование + " недостаточно" +
				" для проведения документа, необходимо еще " + -(Выборка.КоличествоОстаток));
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Удалить все значения в регистре НеучтенныеПродажи
	Если ПриводитсяКУчетуПродаж Тогда
		
		ЗапросРегистраторов = Новый Запрос;
		ЗапросРегистраторов.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистр.Регистратор
		|ИЗ
		|	РегистрНакопления.НеучтенныеПродажи КАК Регистр";
		
		РезультатЗапросаРегистраторов = ЗапросРегистраторов.Выполнить();
		ВыборкаРегистраторов = РезультатЗапросаРегистраторов.Выбрать();
		
		Пока ВыборкаРегистраторов.Следующий() Цикл
			НаборЗаписей = РегистрыНакопления.НеучтенныеПродажи.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистраторов.Регистратор);
			НаборЗаписей.Записать(Истина);
		КонецЦикла
			
	КонецЕсли;
	
КонецПроцедуры
