
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиНоменклатур.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатур.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товары;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Движения.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрОстатковОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	РегистрОстатковОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатур.Остатки(&Дата, Номенклатура В (&Товары)) КАК РегистрОстатковОстатки
		|ГДЕ
		|	РегистрОстатковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Товары"));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		
		Пока Выборка.Следующий() Цикл
			Сообщить("Произошла ошибка: Количество товара " + Выборка.НоменклатураНаименование + " недостаточно" +
				" для проведения документа, необходимо еще " + -(Выборка.КоличествоОстаток));
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.ЗаказОприходован = Ложь И
	|	НАЧАЛОПЕРИОДА(ЗаказКлиента.Дата, День) = НАЧАЛОПЕРИОДА(&Дата, День)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.ДокументСсылка.ПолучитьОбъект();
			Документ.ЗаказОприходован = Истина;
			Документ.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
