&НаКлиенте
Процедура СтандартнаяЕдиницаИзмеренияПриИзменении(Элемент)
	
	Если Запись.СтандартнаяЕдиницаИзмерения Тогда
		Элементы.Множитель.ТолькоПросмотр = Истина;
		Запись.Множитель = 1;
	Иначе
		Элементы.Множитель.ТолькоПросмотр = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	Запись.ВидЕдиницыИзмерения = ПолучитьВидЕдиницыИзмерения(Запись.ЕдиницаИзмерения);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕдиницыИзмерения(ЕдиницаИзмерения)
	Возврат ЕдиницаИзмерения.ВидЕдиницыИзмерения;
КонецФункции

// Данная процедура предназначена для проверки стандартной единицы измерения
// в разрезе вида единицы измерения данной записи
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения.Наименование КАК ВидЕдиницыИзмеренияНаименование,
		|	КОЛИЧЕСТВО(*) КАК КоличествоСтандЕдиницИзмерении
		|ИЗ
		|	РегистрСведений.МножителиЕдиницИзмерения КАК МножителиЕдиницИзмерения
		|ГДЕ
		|	МножителиЕдиницИзмерения.СтандартнаяЕдиницаИзмерения = Истина И
		| 	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения = &Вид
		|СГРУППИРОВАТЬ ПО
		|	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения";
	
	Запрос.УстановитьПараметр("Вид", Запись.ВидЕдиницыИзмерения);
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	
		Если Выборка.КоличествоСтандЕдиницИзмерении > 0 И Запись.СтандартнаяЕдиницаИзмерения Тогда
			Отказ = Истина;
			Сообщить("Невозможно добавить новую запись: Запись со стандартной единицей измерения уже существует!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
