&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.ВидЕдиницыИзмерения = ПолучитьВидЕдиницыИзмерения(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.Цена = ПолучитьЦенуПокупкиПоНоменклатуре(ТекущаяСтрока.Номенклатура);
	ТекущаяСтрока.ЕдиницаИзмерения = СтандартныеЕдиницыИзмерения[ТекущаяСтрока.ВидЕдиницыИзмерения];
	ТоварыЕдиницаИзмеренияПриИзменении(Элемент);
	ТоварыЦенаПриИзменении(Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуПокупкиПоНоменклатуре(Номенклатура)
	Возврат Номенклатура.ПолучитьОбъект().ЦенаПокупки;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидЕдиницыИзмерения(Номенклатура)
	Возврат Номенклатура.ПолучитьОбъект().ВидЕдиницыИзмерения;	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество * ТекущаяСтрока.Множитель;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.СтандартныеЕдиницыИзмерения = ПараметрыСеанса.СтандартныеЕдиницыИзмерения;
	ЭтотОбъект.МножителиЕдиницИзмерения = ПараметрыСеанса.МножителиЕдиницИзмерения;
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТекСтрока.Множитель = МножителиЕдиницИзмерения[ТекСтрока.ЕдиницаИзмерения];
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Множитель = МножителиЕдиницИзмерения[ТекущаяСтрока.ЕдиницаИзмерения];
	ТоварыЦенаПриИзменении(Элемент);
	
КонецПроцедуры
