
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Сумма = Товары.Итог("Сумма");
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РасходыИПродажиНаТовары.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.РасходыИПродажиНаТовары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товары;
		Движение.Сумма = Сумма;
	КонецЦикла;
	
КонецПроцедуры

