
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьЧекаПокупателю)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЧекаПокупателю(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьЧекаПокупателю(ТабДок, ПараметрКоманды)
	Документы.ЧекКлиенту.ПечатьЧекаПокупателю(ТабДок, ПараметрКоманды);
КонецПроцедуры
