
&НаКлиенте
Процедура СохранитьПароль(Команда)
	СохранитьПарольНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПарольНаСервере()
	
	Если Объект.ПользовательИБ <> Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ПользовательИБ);
		
		Если Пользователь <> Неопределено Тогда
			Пользователь.Пароль = ЭтотОбъект.ПарольПользователя;
			Пользователь.Записать();
		Иначе
			Сообщить("Пользователь не найден, возможно пользователь был удален");
		КонецЕсли;
	Иначе
		Сообщить("Для данного сотрудника пользователь не установлен");
	КонецЕсли;
	
КонецПроцедуры
